app/Http/Controllers/API/CertifyController.php

select * from `app_certi_cb` where `app_no` = 'CAL-68-003' limit 1
select * from `app_certi_ib` where `app_no` = 'CAL-68-003' limit 1
select * from `app_certi_labs` where `app_no` = 'CAL-68-003' limit 1
select * from `certificate_exports` where `reference_refno` = 'CAL-68-003' and `certificate_exports`.`deleted_at` is null limit 1
select * from `app_certi_cb_export` where `reference_refno` = 'CAL-68-003' limit 1
select * from `app_certi_ib_export` where `reference_refno` = 'CAL-68-003' limit 1
---
     public function pmt1(Request $request){
            $response = [];
             $str =  explode("-",$request->Ref1);
            //  dd($str);
            if(count($str) == 4){
              $app_no =  $str['0'].'-'.$str['1'].'-'.$str['2'];
            }else{
              $app_no =  $request->Ref1;
            }
            $pid    =  $request->pid;
            $certi_cb = CertiCb::where('app_no',$app_no)->first();
            $certi_ib = CertiIb::where('app_no',$app_no)->first();
            $certi_lab = CertiLab::where('app_no',$app_no)->first();
            $export_lab = CertificateExport::where('reference_refno',$app_no)->first();
            $export_cb  = CertiCBExport::where('reference_refno',$app_no)->first();
            $export_ib  = CertiIBExport::where('reference_refno',$app_no)->first();

select * from `epayment_bill_test` where `Ref1` = 'CAL-68-003-1924' limit 1
---
                $response['auditor']            = "คณะ";


                $epay =  EpaymentBillTest::where('Ref1',$request->Ref1)->first();

select * from `epayment_bill_test` where `Ref1` = 'CAL-68-004-19251739686518'
update `epayment_bill_test` set `Status` = 1, `updated_at` = '2025-02-16 13:39:08' where `Ref1` = 'CAL-68-004-19251739686518'
---
     public function pmt2(Request $request){
       $response = [];

       if(!empty($request->ref1)){
        EpaymentBillTest::where('Ref1',$request->ref1)->update([
          'Status' => 1
        ]);
             $epays =  EpaymentBillTest::where('Ref1',$request->ref1)->get();

select * from `epayment_bill_test` where `Ref1` = 'SurLab-68-328-3141739858046'
---
          $response['QRCodeString']       = "|099400015951015%0D6402090000016310%0D64041072%0D3600000";


         $epay =  EpaymentBillTest::where('Ref1',$request->Ref1)->first();