app/Http/Controllers/API/CertifyController.php

        {

          $tracking = Tracking::where('reference_refno',$app_no)->first();
          $export_lab = CertificateExport::find($tracking->ref_id);
---
select * from `certificate_exports` where `certificate_exports`.`id` = 990 and `certificate_exports`.`deleted_at` is null limit 1

          $response['status']             = "0";
          $response['auditor']            = "คณะ";

          $epay =  EpaymentBillTest::where('Ref1',$request->Ref1)->first();
---
select * from `epayment_bill_test` where `Ref1` = 'SurLab-68-328-314' limit 1

     public function pmt2(Request $request){
       $response = [];

       if(!empty($request->ref1)){
          EpaymentBillTest::where('Ref1',$request->ref1)->update([
            'Status' => 1
          ]);
---
update `epayment_bill_test` set `Status` = 1, `updated_at` = '2025-02-18 12:54:35' where `Ref1` = 'SurLab-68-328-3141739858046'