app/Http/Controllers/Certify/CheckCertificateLabController.php

select * from `app_certi_labs` where `app_certi_labs`.`id` = 2028 limit 1
---
      public function update_payin1(Request $request, $id)
      {

             $previousUrl = app('url')->previous();
             $find_cost_assessment  =  CostAssessment::findOrFail($id);
             $certi_lab  =  CertiLab::findOrFail($find_cost_assessment->app_certi_lab_id);

select * from `app_certi_labs` where `id` = 2028 limit 1
---
    public function show(Check $cc)
    {
        // dd('helo');
        // $checking_list = [
        //     2 => 'อยู่ระหว่างการตรวจสอบ',
        //     3 => 'ขอเอกสารเพิ่มเติม',
        //     5 => 'ไม่ผ่านการตรวจสอบ',
        //     6 => 'ผ่านการตรวจสอบ',
        //     7 => 'รอชำระค่าธรรมเนียม',
        //     9 => 'รับคำขอ',
        // ];
        //การประมาณการค่าใช้จ่าย
        $Cost      = Cost::where('app_certi_lab_id',$cc->app_certi_lab_id)->orderByDesc('id')->first();
        $certi_lab = CertiLab::where('id',$cc->app_certi_lab_id)->first();

select * from `certificate_history` where `app_no` = 'CAL-68-002' or `app_no` = 'RQ-LAB-68-002' order by `id` desc
---
                $app_no =  $app_no.'-'.$appno[1].'-'.$appno[2];
            }
        }
        $history   = CertificateHistory::where('app_no',$cc->applicant->app_no)->orwhere('app_no',$app_no)->orderByDesc('id')->get();

select * from `certificate_export_mapreq` where (`app_certi_lab_id` = 2028 and `certificate_exports_id` = 990) limit 1
---
            }

            //Map ใบสมัครกับใบรับรอง
            $MapCertify      = CertiLabExportMapreq::where(['app_certi_lab_id' => $cc->app_certi_lab_id, 'certificate_exports_id' =>  $CheckLabCertify->id ])->first();

select * from `app_certi_lab_attach_all` where `app_certi_lab_id` = 2028 and `file_section` = '62' order by `created_at` desc limit 1
---
    public function copyScopeLabFromAttachement($app)
    {
        $copiedScoped = null;
        $fileSection = null;

        if($app->lab_type == 3){
           $fileSection = "61";
        }else if($app->lab_type == 4){
           $fileSection = "62";
        }

        $latestRecord = CertiLabAttachAll::where('app_certi_lab_id', $app->id)
        ->where('file_section', $fileSection)
        ->orderBy('created_at', 'desc') // เรียงลำดับจากใหม่ไปเก่า
        ->first();