app/Http/Controllers/Certify/CB/CheckCertificateCBController.php

select `title`, `id` from `app_certi_ib_status` where `id` not in (0)
---
                            ->pluck('title','runrecno');


            $status  = CertiIBStatus::select('title','id')->whereNotIn('id',[0])->pluck('title','id');

select * from `app_certi_cb` where `token` = 'H14cbkzCAZxv1oF1' limit 1
select * from `app_certi_cb_history` where `app_certi_cb_id` = 237 order by `id` desc
---
    public function show($token)
    {
        // dd('ok');
        $model = str_slug('checkcertificatecb','-');
        if(auth()->user()->can('view-'.$model)) {
            $certi_cb = CertiCb::where('token',$token)->first();
            // ประวัติคำขอ
            $config = HP::getConfig();
            $url  =   !empty($config->url_acc) ? $config->url_acc : url('');
            $history  =  CertiCbHistory::where('app_certi_cb_id',$certi_cb->id)
                                        ->orderby('id','desc')
                                        ->get();