app/Models/Certify/ApplicantCB/CertiCb.php

    public function getCertiCBAuditorsStatusAttribute() {
        $data = HP::getArrayFormSecondLevel($this->CertiCBAuditorsManyBy->toArray(), 'id');
        $list = '';
        $datas = CertiCBAuditors::whereIn('id', $data)
        ->whereNull('is_review_state')
        ->pluck('status')
        ->toArray();
---
select `status` from `app_certi_cb_auditors` where `id` in (347, 346, 345) and `is_review_state` is null