app/Models/Certify/ApplicantCB/CertiCBAuditors.php

select `start_date`, `end_date` from `app_certi_cb_auditors_date` where `id` in (394)
---
 public function getCertiCBAuditorsDateTitleAttribute() {
    $data = HP::getArrayFormSecondLevel($this->CertiCBAuditorsDates->toArray(), 'id');
    $datas = CertiCBAuditorsDate::select('start_date','end_date')->whereIn('id', $data)->get();