app/Http/Controllers/HelperController.php

select * from `roles` where `roles`.`id` = 1 limit 1
---
    public function addPermission()
    {
        $admin = User::where('reg_email','=','admin@admin.com')->withTrashed()->first();

        $admin_role = Role::find(1);